#include <stdio.h>
#include <stdlib.h>
#include <windows.h>

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // Р’РѕСЃСЊРјРѕРµ Р·Р°РґР°РЅРёРµ:
    // РћРїРµСЂР°С‚РѕСЂ for (С†РёРєР» СЃ РїСЂРµРґСѓСЃР»РѕРІРёРµРј РёР»Рё РїР°СЂР°РјРµС‚СЂРёС‡РµСЃРєРёР№, СЃ Р·Р°РґР°РЅРЅС‹Рј С‡РёСЃР»РѕРј РїРѕРІС‚РѕСЂРµРЅРёР№) 
    // РІС‹РїРѕР»РЅСЏРµС‚СЃСЏ РЅРё СЂР°Р·Сѓ РёР»Рё Р±РѕР»РµРµ С‚РѕРіРѕ, Р·Р°РІРёСЃРёС‚ РѕС‚ СѓСЃР»РѕРІРЅРѕРіРѕ РІС‹СЂР°Р¶РµРЅРёСЏ
    // РЎРёРЅС‚Р°РєСЃРёСЃ РґР»СЏ РѕРїРµСЂР°С‚РѕСЂР° for
    // for(РёРЅРёС†РёР°Р»РёР·Р°С†РёСЏ; СѓСЃР»РѕРІРёРµ; РІС‹СЂР°Р¶РµРЅРёРµ С†РёРєР»Р°) <РѕРїРµСЂР°С‚РѕСЂ>
    int j = 3;
    for(int i = 0; i < 10; i++) j++;
    for (size_t i = 0; i < count; i++)
    {
        /* code */
    }
    

    // РџРµСЂРІС‹Рј С€Р°РіРѕРј РїСЂРё РІС‹РїРѕР»РЅРµРЅРёРµ РґР°РЅРЅРѕРіРѕ С†РёРєР»Р° СЏРІР»СЏРµС‚СЃСЏ РІС‹С‡РёСЃР»РµРЅРёРµ РІС‹СЂР°Р¶РµРЅРёСЏ РёРЅРёС†РёР°Р»РёР·Р°С†РёРё
    // РџРѕС‚РѕРј РІС‹РїРѕР»РЅСЏРµС‚СЃСЏ СѓСЃР»РѕРІРёРµ, РµСЃР»Рё РѕРЅРѕ РёСЃС‚РёРЅРЅРѕ, С‚Рѕ РІС‹РїРѕР»РЅСЏРµС‚СЃСЏ РѕРїРµСЂР°С‚РѕСЂ
    // Р•СЃР»Рё СѓСЃР»РѕРІРёСЏ РЅРµС‚, С‚Рѕ РѕРЅРѕ РІСЃРµРіРґР° РІС‹РїРѕР»РЅСЏРµС‚СЃСЏ
    // Р•СЃР»Рё СѓСЃР»РѕРІРёРµ Р»РѕР¶РЅРѕРµ, С‚Рѕ РѕРїРµСЂР°С‚РѕСЂ Р·Р°РєР°РЅС‡РёРІР°РµС‚СЃСЏ

    // Р”РµРІСЏС‚РѕРµ Р·Р°РґР°РЅРёРµ:
    // РћРїРµСЂР°С‚РѕСЂ do (С†РёРєР» СЃ РїРѕСЃС‚СѓСЃР»РѕРІРёРµРј) РІС‹РїРѕР»РЅСЏРµС‚СЃСЏ С…РѕС‚СЏ Р±С‹ РѕРґРёРЅ СЂР°Р· Рё РґРѕ С‚РѕРіРѕ РјРѕРјРµРЅС‚Р°, РєРѕРіРґР° РІС‹СЂР°Р¶РµРЅРёРµ РёСЃС‚РёРЅРЅРѕ
    // РЎРёРЅС‚Р°РєСЃРёСЃ РґР»СЏ РѕРїРµСЂР°С‚РѕСЂ do
    do
    {
        break;
    } while (j < 0);

    // РџРµСЂРІС‹Рј С€Р°РіРѕРј РѕРЅ РІС‹РїРѕР»РЅСЏРµС‚ РѕРїРµСЂР°С‚РѕСЂ РІРЅСѓС‚СЂРё С†РёРєР»Р°, Р° Р·Р°С‚РµРј РІС‹С‡РёСЃР»СЏРµС‚СЃСЏ РІС‹СЂР°Р¶РµРЅРёРµ
    // Р•СЃР»Рё РІС‹СЂР°Р¶РµРЅРёРµ РёСЃС‚РёРЅРЅРѕ, С‚Рѕ РѕРЅ РїСЂРѕРґРѕР»Р¶Р°РµС‚ СЂР°Р±РѕС‚Р° - РёРЅР°С‡Рµ Р·Р°РІРµСЂС€Р°РµС‚

    // Р”РµСЃСЏС‚РѕРµ Р·Р°РґР°РЅРёРµ:
    // РћРїРµСЂР°С‚РѕСЂ while РІС‹РїРѕР»РЅСЏРµС‚СЃСЏ РЅРё СЂР°Р·Сѓ РёР»Рё Р±РѕР»РµРµ, РїРѕРєР° РІС‹СЂР°Р¶РµРЅРёРµ РЅРµ СЃС‚Р°РЅРµС‚ Р»РѕР¶РЅС‹Рј

    while (j < 0)
    {
        break;
    }
    
    // РџРµСЂРІС‹Рј С€Р°РіРѕРј РѕРЅ РІС‹С‡РёСЃР»СЏРµС‚ РІС‹СЂР°Р¶РµРЅРёРµ, РµСЃР»Рё РёСЃС‚РёРЅРЅРѕ - РІС‹РїРѕР»РЅСЏРµС‚ РѕРїРµСЂР°С‚РѕСЂ, РёРЅР°С‡Рµ- Р·Р°РІРµСЂС€Р°РµС‚ СЂР°Р±РѕС‚Сѓ
    // РџРµСЂРµРґ РєР°Р¶РґС‹Рј СЃР»РµРґСѓСЋС‰РёРј РІС‹РїРѕР»РЅРµРЅРёРµРј С‚РµР»Р° РѕРїРµСЂР°С‚РѕСЂР° РІС‹СЂР°Р¶РµРЅРёРµ РїРµСЂРµРІС‹С‡РёСЃР»СЏРµС‚СЃСЏ

    // РћРґРёРЅРЅР°РґС†Р°С‚РѕРµ Р·Р°РґР°РЅРёРµ:
    // РћРїРµСЂР°С‚РѕСЂ break РїРѕР»РЅРѕСЃС‚СЊСЋ Р·Р°РІРµСЂС€Р°РµС‚ РІС‹РїРѕР»РЅРµРЅРёРµ РѕРїРµСЂР°С‚РѕСЂРѕРІ do, while, switch, for
    // РџРѕСЃР»Рµ Р·Р°РІРµСЂС€РµРЅРёСЏ РѕРїРµСЂР°С‚РѕСЂРѕРІ, СЂР°Р±РѕС‚Р° РїРµСЂРµС…РѕРґРёС‚ РЅР° СЃР»РµРґСѓСЋС‰РёР№ РѕРїРµСЂР°С‚РѕСЂ
    // РџСЂРё РІС‹РІРѕРґРµ РІРЅРµ С†РёРєР»РѕРІ Рё switch РјРѕР¶РµС‚ РїСЂРёРІРµСЃС‚Рё Рє РѕС€РёР±РєРµ

    // РћРїРµСЂР°С‚РѕСЂ continue Р·Р°РІРµСЂС€Р°РµС‚ РёС‚РµСЂР°С†РёСЋ РІ С†РёРєР»Р°С… Рё РІРµРґС‘С‚ Рє СЃР»РµРґСѓСЋС‰РµР№, РІ РєРѕС‚РѕСЂРѕР№ РѕРЅ РјРѕР¶РµС‚ РїРѕСЏРІРёС‚СЃСЏ
    // РћСЃС‚Р°РІС€РёРµСЃСЏ РѕРїРµСЂР°С‚РѕСЂС‹ РІ С†РёРєР»Рµ РЅРµ РІС‹РїРѕР»РЅСЏСЋС‚СЃСЏ
    // Р”Р»СЏ for - СЃР»РµРґСѓСЋС‰Р°СЏ РёС‚РµСЂР°С†РёСЏ РЅР°С‡РёРЅР°РµС‚СЃСЏ СЃ РІС‹СЂР°Р¶РµРЅРёСЏ С†РёРєР»Р° РѕРїРµСЂР°С‚РѕСЂР°
    // Р”Р»СЏ while Рё do - РїРµСЂРµРІС‹С‡РёСЃР»СЏРµС‚ РІС‹СЂР°Р¶РµРЅРёСЏ

    // РћРїРµСЂР°С‚РѕСЂ return РІРѕР·РІСЂР°С‰Р°РµС‚ Р·РЅР°С‡РµРЅРёСЏ С„СѓРЅРєС†РёРё РёР»Рё СЌРєСЃС‚СЂРµРЅРЅРѕРіРѕ РІС‹С…РѕРґР° РёР· РЅРµС‘
    // Р’С‹С…РѕРґ РјРѕР¶РµС‚ Р±С‹С‚СЊ РІРµР·РґРµ
    // Р•СЃР»Рё С„СѓРЅРєС†РёСЏ РІРѕР·РІСЂР°С‰Р°РµС‚ Р·РЅР°С‡РµРЅРёРµ, С‚Рѕ РІ РЅРµР№ РґРѕР»Р¶РЅРѕ Р±С‹С‚СЊ РїСЂРѕРїРёСЃР°РЅРѕ РІС‹СЂР°Р¶РµРЅРёРµ
    // РћРїРµСЂР°С‚РѕСЂ return Р·Р°РІРµСЂС€Р°РµС‚ РЅРµ С‚РѕР»СЊРєРѕ С†РёРєР», РЅРѕ Рё РІСЃСЋ РїСЂРѕРіСЂР°РјРјСѓ РІ С†РµР»РѕРј
}